# Core Tools
brew "tmux"
brew "neovim"
brew "fzf"
brew "fd"
brew "bat"
brew "eza"
brew "git-delta"
brew "zoxide"
brew "ripgrep"
brew "jq"
brew "curl"
brew "wget"

# Shell
brew "zsh"
brew "oh-my-zsh"

# Dev tools
brew "pyenv"
brew "nvm"
brew "go"
brew "lazygit"

# Productivity
brew "gh"
brew "htop"
brew "httpie"
brew "thefuck"
brew "shell-gpt"

# Install ghostty (not on Homebrew, use direct download)
# brew install --cask ghostty
